[
    "I felt good at work this week.",
    "I would describe my relationship with my colleagues as good this week.",
    "I am satisfied with relationship with my direct supervisor.",
    "I am paid adequately for the job I do.",
    "I would be happy to work for this company in a long-term future.",
    "I have talked with someone about my professional development within the company in the past three months.",
    "I have a trust in my co-workers.",
    "I feel there's been a mutual respect between me and my colleagues this week.",
    "My work enviroment inspire me to do my best at work.",
    "I feel that my team leader cares about me.",
    "I believe that emloyees in our company are encouraged to express their opinions.",
    "I see an added value in what I do in my job.",
    "The purpose of my organization makes me feel my job is important.",
    "I have done the things that I am the most proficient at this week.",
    "I have felt good when working with my team leader this week.",
    "I have all the necessary tools required to complete my tasks.",
    "I have all the necessary knowledge required to complete my tasks.",
    "I can rely on my colleagues when it comes to completing their tasks.",
    "I would start to work for this company again.",
    "I feel management could do more to motivate me.",
    "I feel I get enough support from the company's management.",
    "I have enough time to do my job properly.",
    "I have an opportunity to learn and improve myself within the company.",
    "My opinions are beeing treated with respect.",
    "I felt productive at work this week.",
    "I know what is expected of me at work.",
    "I get help from my colleagues when I need it.",
    "My team leader always helping me to excel.",
    "I have a sense of belonging to our company.",
    "I have advanced on a personal level recently.",
    "I recieve enough feedback in my work.",
    "I found my this week's tasks meaningful.",
    "I feel that the company's management trust me.",
    "I would find it hard to leave this company.",
    "I feel management could do more to improve my working's conditions.",
    "I feel I need help to become more productive at work.",
    "The feedback I am recieving is always constructive."
]
